g = ["у", "е", "ы", "а", "о", "э", "я", "и", "ю"]

s = {
    1: 'як сад',
    2: 'ду сад',
    3: 'се сад',
    4: 'чор сад',
    5: 'панч сад',
    6: 'шаш сад',
    7: 'хафт сад',
    8: 'хашт сад',
    9: 'нух сад',
    0: ''
}

d = {
    0: '',
    2: 'бист',
    3: 'си',
    4: 'чил',
    5: 'панчох',
    6: 'шаст',
    7: 'хафтод',
    8: 'хаштод',
    9: 'навад',
}

y = {
    1: 'як',
    2: 'ду',
    3: 'се',
    4: 'чор',
    5: 'панч',
    6: 'шаш',
    7: 'хафт',
    8: 'хашт',
    9: 'нух',
    0: ''
}

dd = {
    10: 'дах',
    11: 'ёздах',
    12: 'дувоздах',
    13: 'сездах',
    14: 'чордах',
    15: 'понздах',
    16: 'шонздах',
    17: 'хабдах',
    18: 'хаждах',
    19: 'нуздах'
}
n = int(input())
if n > 99:
    a = n // 100
    b = n // 10 % 10
    c = n % 10
    res = s[a]
    if b > 1 or (c and b != 1):
        res += 'у '
        res += d[b]
        if len(y[c]) and len(d[b]):
            if res[-1] not in g:
                res += 'у '
            else :
                res += 'ву '
        res += y[c]
    elif n % 100 < 20 and n % 100 > 0:
        res += 'у ' + dd[n % 100]
    print(res if res != 'як сад' else res[res.index(' ') + 1:])

elif n < 100 and n > 9:
    if n < 20:
        print(dd[n])
    else :
        res = d[n // 10]
        if n % 10:
            if res[-1] in g:
                res += 'ву '
            else :
                res += 'у'
            res += y[n % 10]
        print(res)

elif n < 10:
    print(y[n])
