g = ["у", "е", "ы", "а", "о", "э", "я", "и", "ю"]
d = {
    0: '',
    2: 'бист',
    3: 'си',
    4: 'чил',
}

y = {
    1: 'як',
    2: 'ду',
    3: 'се',
    4: 'чор',
    5: 'панч',
    6: 'шаш',
    7: 'хафт',
    8: 'хашт',
    9: 'нух',
    0: ''
}

dd = {
    10: 'дах',
    11: 'ёздах',
    12: 'дувоздах',
    13: 'сездах',
    14: 'чордах',
    15: 'понздах',
    16: 'шонздах',
    17: 'хабдах',
    18: 'хаждах',
    19: 'нуздах'
}
n = int(input())
if n > 19:
    res = d[n // 10]
    if len(y[n % 10]):
        if res[-1] in g:
            res += ('ву ' + y[n % 10])
        else :
            res += ('у ' + y[n % 10])
    print(res)
else :
    print(dd[n])
